GetPhaseStatus Method
 Gets the status of a given element in the input phase
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ElementOnPhaseStatus GetPhaseStatus(
	ElementId phaseId
)
Visual Basic
Public Function GetPhaseStatus ( _
	phaseId As ElementId _
) As ElementOnPhaseStatus
Visual C++
public:
ElementOnPhaseStatus GetPhaseStatus(
	ElementId^ phaseId
)
Parameters
phaseId
Type: Autodesk.Revit.DBElementId
 Id of the phase.
Return Value
 The status of the element in the phase.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  The id does not represent a valid phase.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →